# IsValidSpecificFittingAngle Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctSettings..::..IsValidSpecificFittingAngle Method
DuctSettings Class See Also
---
Checks that the given value is a valid specific fitting angle. The specific fitting angles are angles of 90, 60, 45, 30, 22.5 or 11.25 degrees.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsValidSpecificFittingAngle(
	double angle
)
```

Visual Basic
---
```text
Public Function IsValidSpecificFittingAngle ( _
	angle As Double _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidSpecificFittingAngle(
	double angle
)
```

# ### Parameters
angle
    Type: System..::..Double The angle value (in degree).
# ### Return Value
True if the given value is a valid specific fitting angle.
# See Also
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace